xml_tmpl/new_zone.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <new_zone xmlns="http://127.0.0.1:8082/NicToolServer/SOAP">
      <struct>
        <nt_user_session>#NT_USER_SESSION#</nt_user_session>
        <nt_zone_id>#NT_ZONE_ID#</nt_zone_id>
        <nt_group_id>#NT_GROUP_ID#</nt_group_id>
        <zone>#ZONE#</zone>
        <ttl>#TTL#</ttl>
        <serial>#SERIAL#</serial>
        <nameservers>#NAMESERVERS#</nameservers>
        <mailaddr>#MAILADDR#</mailaddr>
        <description>#DESCRIPTION#</description>
        <refresh>#REFRESH#</refresh>
        <retry>#RETRY#</retry>
        <expire>#EXPIRE#</expire>
        <minimum>#MINIMUM#</minimum>
      </struct>
    </new_zone>
  </soap:Body>
</soap:Envelope>


